Rt=zeros(3,3,100);
r1=zeros(3,3,100);
delta_Rt=zeros(3,3,100);
%R0=[3^0.5/2 0.5 0;0.5 3^0.5/2 0;0 0 1];   %正则坐标
%Re=[3^0.5 1 0;1 3^0.5 0;0 0 2];   %正则坐标
R0=[0.866 -0.5 0;0.5 0.866 0;0 0 1];
Re=[0.5 -0.866 0;0.866 0.5 0;0 0 1];
a=[0 pi/3 0; -pi/3 0 0;0 0 0];
b=[0 -pi/2 0; pi/2 0 0;0 0 0];
for i=1:100
    t=i*0.01;
    r=a*t^3+b*t^2;
    temp=(r(1,2)^2+r(1,3)^2+r(2,3)^2)^0.5;
    R=[1 0 0;0 1 0;0 0 1]+sin(temp)/temp*r+(1-cos(temp))/temp^2*r^2;
    Rt(:,:,i)=R0*R;
    
    Tr(i)=Rt(1,1,i)+Rt(2,2,i)+Rt(3,3,i);
    fai(i)=acos((Tr(i)-1)/2);
    r1(:,:,i)=(Rt(:,:,i)-Rt(:,:,i)')/2/sin(fai(i));
end
for i=2:100
    t=i*0.01;
    delta_Rt(:,:,i-1)= (Rt(:,:,i)- Rt(:,:,i-1))/0.01;
    w_b(:,:,i)=Rt(:,:,i)'*delta_Rt(:,:,i-1);%在动坐标系下的角速度，即绕一个轴转动的角速度。
    w_s(:,:,i)=delta_Rt(:,:,i-1)*Rt(:,:,i);
end
